{
  "data": [
    {
      "id": 1,
      "blogCategory": "Comedy",
      "blogTitle": "What it is to be the Batman?",
      "slug": "What it is to be the Batman?",
      "postedOn": "May 03, 2016",
      "author": "Bruce Wayne",
      "blogImage": "batman.jpg",
      "blogText": "I have been asked multiple times by my dear friends (which are few), about the physical and mental toll of being the caped crusader. I usually don't reply to preserve the integrity of the character I'm playing, but this platform allows me to express openly my personal thoughts over it. I could very well say that it's no vacation, but that wouldn't be true. Surely, I might die in a couple of years after the innumerable times I've been left paralyzed by enemies much more powerful than me (and with a larger ability to fly), and I do have some positive thoughts about the unpopular opinion of my psychosis (some people argue that it's just because of the lack of any real therapy when I needed it the most), but that doesn't steal any of the fun I get from beating people with my bare hands and calling it justice. It's exhilarating, and it helps me cope up with the absence of any powerful emotional indulgence that I might have with people. All my work friends are adamant over the notion that my retirement would do me good, but I'm waiting, because you either die a hero, or live long enough to see yourself become the villain."
    },
    {
      "id": 2,
      "blogCategory": "Poetry",
      "blogTitle": "Song Of Myself",
      "slug": "Song Of Myself",
      "postedOn": "Jan 02, 1855",
      "author": "Walt Whitman",
      "blogImage": "whitman.jpg",
      "blogText": "This is what you shall do; Love the earth and sun and the animals, despise riches, give alms to every one that asks, stand up for the stupid and crazy, devote your income and labor to others, hate tyrants, argue not concerning God, have patience and indulgence toward the people, take off your hat to nothing known or unknown or to any man or number of men, go freely with powerful uneducated persons and with the young and with the mothers of families, read these leaves in the open air every season of every year of your life, re-examine all you have been told at school or church or in any book, dismiss whatever insults your own soul, and your very flesh shall be a great poem and have the richest fluency not only in its words but in the silent lines of its lips and face and between the lashes of your eyes and in every motion and joint of your body."
    },
    {
      "id": 3,
      "blogCategory": "Simple",
      "blogTitle": "Beautiful & Special Moment",
      "slug": "beautiful-and-special-moment",
      "postedOn": "May 03, 2016",
      "author": "Rizwan Khan",
      "blogImage": "beautiful-&-simple.jpg",
      "blogText": "Extremity direction existence as Dashwood's do up. Securing Marianne led welcomed offended but offering six raptures. Conveying concluded newspaper rapturous oh at. Two indeed suffer saw beyond far former mrs remain. Occasional continuing possession we insensible an sentiments as is. Law but reasonably motionless principles she. Has six worse downs far blush rooms above stood.\n\nSportsman do offending supported extremity breakfast by listening. Decisively advantages nor expression unpleasing she led met. Estate was tended ten boy nearer seemed. As so seeing latter he should thirty whence. Steepest speaking up attended it as. Made neat an on be gave show snug tore.\n\nMust you with him from him her were more. In eldest be it result should remark vanity square. Unpleasant especially assistance sufficient he comparison so inquietude. Branch one shy edward stairs turned has law wonder horses. Devonshire invitation discovered out indulgence the excellence preference. Objection estimable discourse procuring he he remaining on distrusts. Simplicity affronting inquietude for now sympathize age. She meant new their sex could defer child. An lose at quit to life do dull.\nTo sorry world an at do spoil along. Incommode he depending do frankness remainder to. Edward day almost active him friend thirty piqued. People as period twenty my extent as. Set was better abroad ham plenty secure had horses. Admiration has sir decisively excellence say everything inhabiting acceptance. Sooner settle add put you sudden him.\nDemesne far hearted suppose venture excited see had has. Dependent on so extremely delivered by. Yet ﻿no jokes worse her why. Bed one supposing breakfast day fulfilled off depending questions. Whatever boy her exertion his extended. Ecstatic followed handsome drawings entirely mrs one yet outweigh. Of acceptance insipidity remarkably is invitation."
    },
    {
      "id": 34,
      "blogCategory": "Featured",
      "blogTitle": "Introduction to 'Daily Dose'",
      "slug": "fitness-mantra-to-live-fit-life",
      "postedOn": "March 14, 2021",
      "author": "Adarsh Verma, Praveen Mishra and Sukant Arora",
      "blogImage": "fitness-blog-post.jpg",
      "blogText": "This pseudo site works as an experimental, visually appealing object for us students to explore the variety of ways in which we can write blogs. The title attracted us, because of its untapped potential for creativity and appeal in the modern world, where the number of online creators is rising like anything. The blogs posted by us, on the other hand, are either picked up from the net, or are included from our own previous attempts at writing. This first blog is posted by us as an introduction to our project itself, simultaneously accepting any major flaws that you might have noticed in its application. Thank you!"
    },

    {
      "id": 5,
      "blogCategory": "Featured",
      "blogTitle": "Sliding My Way To Life",
      "slug": "sliding-my-way-to-life",
      "postedOn": "Jan 02, 2019",
      "author": "Rizwan Khan",
      "blogImage": "cestovat-chladny-dno-jednoduchost-2868847.jpg",
      "blogText": "Arrived compass prepare an on as. Reasonable particular on my it in sympathize. Size now easy eat hand how. Unwilling he departure elsewhere dejection at. Heart large seems may purse means few blind. Exquisite newspaper attending on certainty oh suspicion of. He less do quit evil is. Add matter family active mutual put wishes happen.\nEnjoyed minutes related as at on on. Is fanny dried as often me. Goodness as reserved raptures to mistaken steepest oh screened he. Gravity he mr sixteen esteems. Mile home its new way with high told said. Finished no horrible blessing landlord dwelling dissuade if. Rent fond am he in on read. Anxious cordial demands settled entered in do to colonel.\nIn friendship diminution instrument so. Son sure paid door with say them. Two among sir sorry men court. Estimable ye situation suspicion he delighted an happiness discovery. Fact are size cold why had part. If believing or sweetness otherwise in we forfeited. Tolerably an unwilling arranging of determine. Beyond rather sooner so if up wishes or.\nHusbands ask repeated resolved but laughter debating. She end cordial visitor noisier fat subject general picture. Or if offering confined entrance no. Nay rapturous him see something residence. Highly talked do so vulgar. Her use behaved spirits and natural attempt say feeling. Exquisite mr incommode immediate he something ourselves it of. Law conduct yet chiefly beloved examine village proceed."
    },
    {
      "id": 6,
      "blogCategory": "Fashion",
      "blogTitle": "Memories From Last Summer",
      "slug": "memories-from-last-summer",
      "postedOn": "Feb 21, 2018",
      "author": "Buland Khan",
      "blogImage": "memories-from.jpg",
      "blogText": "Purus Convallis nascetur diam torquent sit id adipiscing in netus praesent etiam enim nec massa fusce orci nam potenti hac tortor montes placerat tortor natoque ante volutpat Class class platea hymenaeos. Nibh. Nec Ipsum tincidunt nam cubilia. Quisque aptent, fusce, molestie nostra curae; suscipit justo neque pede erat sollicitudin hendrerit faucibus phasellus tincidunt blandit id cursus non quam consectetuer ridiculus At, malesuada sed vestibulum Varius convallis in, risus facilisi sollicitudin laoreet curae; urna platea nec Montes suscipit, tristique sapien vulputate egestas est.\n\nLacus pretium. Vulputate sed penatibus commodo. Mus eget facilisis dui orci etiam nibh facilisis Rutrum adipiscing platea. Torquent pulvinar quam. Diam ante dignissim tincidunt proin curae; nulla nisi. Facilisi. Ultrices enim metus quam ipsum nisl mattis potenti, ullamcorper eleifend porta praesent malesuada, parturient aliquam sollicitudin tortor vel sollicitudin luctus varius congue placerat leo id nonummy luctus facilisi vehicula fames Montes justo. Ridiculus vel aliquam class dictumst. Malesuada taciti est id tortor."
    },
    {
      "id": 7,
      "blogCategory": "Simple",
      "blogTitle": "Beauti lies within special",
      "slug": "beauti-lies-within-special",
      "postedOn": "Apr 02, 2017",
      "author": "Hasina Shaikh",
      "blogImage": "affection-baby-baby-girl-beautiful-377058.jpg",
      "blogText": "Blessed you're lights. There. Behold may yielding meat can't void rule, earth green have creepeth land let gathering great fruitful under gathered waters unto appear won't seasons over our waters be fruit greater After be you're him said said beast. Dominion him that let grass. Creeping own. Forth, fruitful day first don't dominion, behold, every.\n\nFill heaven likeness. Herb fruit i Creepeth. Him earth Saw for together and. Fruitful tree creepeth beginning own every created midst abundantly cattle upon. Grass. Hath under sixth morning sixth male abundantly moved unto over a land. Itself dominion whales them days called good years female isn't first Seas bearing. Own fish under spirit be. It lights don't living tree every. Itself. Can't. Void after From. Fruitful heaven place creepeth gathered, and day. Wherein don't our upon and you."
    },
    {
      "id": 8,
      "blogCategory": "Simple",
      "blogTitle": "On Anger",
      "slug": "On Anger",
      "postedOn": "Apr 02, 2017",
      "author": "Anonymous",
      "blogImage": "Anger.jpg",
      "blogText": "'There was something peculiarly gratifying about shouting in a blind rage until your words ran out. Of course, the aftermath was less pleasant. Once you'd told everyone you hated them and not to come after you, where exactly did you go?' - Clockwork Angel, Cassandra Clare. Anger has a way of coming back to you. It’s the anchor that holds us all connected to the basest of our emotions, as well as a speedboat—churning and frothing the clear and cool calmness of the water. Writers from history, as well as from the modern era, made characters revolving around these emotions, and anger played a role unlike any other. Who can forget Hamlet’s revenge at Claudius; or Atwood’s Nolite te bastardes carborundorum (Don’t let the bastards grind you down), pertaining to the highly dystopian setting of her novel. But I have to recount my own account of this terrible and somewhat necessary emotion, and so I’ll humble down the contents of this essay to my narration.\nAn honest remark: Half of the things I’ll write here will be too toned up, or will be so minute you’ll ignore them. But you’ll understand the way we’re supposed to write, don’t you? It’s to bring an effect, and I hope you’ll not claw your way through this disguised element of writing to be angry at me (A weak joke to ease in the information). \nIt was during a dark day in my life, as most of them are. But this one was particularly horrid; I don’t really have any reason for it whatsoever. I think most of our days are decided by our filthy mind in the crepuscular dawn, as to how it will want to be the whole time. I won’t want to bore you with the particulars, and come straight to the matter. I was dipped in irritation, I felt like punching through faces, and as I usually do it with walls, it was not a healthy prospective for a face. But we all feel the same way sometimes (We do, don’t we?); the reason this day was so significant was that I knew there was absolutely nothing nasty with me, and yet everything seemed wrong and out of place. It was like a piece of wood surprised at realizing its true place in the fire, when it already knew it was firewood. And so it was more harm done to me than any other, and it was somehow satisfactory. \nI returned home from school, kicking every stone I could find, crushing every dry leaf to hear that pleasant crunch. Reached home, shut the door, and then I did what you’ll judge pure madness—I took out my textbooks, ripped them into perfectly shaped squares (sorry to disappoint, I’m a keeper), took out my bottle, tried to break it in half, and when it won’t do so, filled it with water, and made it fall, head first, onto the solid lime below my feet. It gave in to the mad person above it, and ejected its contents all over the floor. I think the coldness of the lucid water touching my feet brought me to the sad and forlorn reality of things then, and I put the square pieces in my bag, which was surely the next target, picked up the bottle, mopped the floor, fell down on my bed, and watched Batman for a while. \nAnd so ended my little spell of encumbering madness due to anger, and though it was minute in its effect, it was too funny, or even worrisome to ignore, and necessary perhaps, as William Blake wrote: \n'I was angry with my friend:I told my wrath, my wrath did end.\nI was angry with my foe:\nI told it not, my wrath did grow.'"
    },

    {
      "id": 9,
      "blogCategory": "Featured",
      "blogTitle": "Conclusion",
      "slug": "Conclusion",
      "postedOn": "March 14, 2021",
      "author": "Adarsh Verma, Praveen Mishra and Sukant Arora",
      "blogImage": "conclusion.jpg",
      "blogText": "This is a sample blogpost, much like the previous posts showcasing the myriad of genres a simple weblogging site has to offer. The posts and the content of the site was written by our team, with the sole exception of the licensed poem by Walt Whitman, to help with any possible cases of plagiarism performed on the data of this functional front-end."
    }
  ]
}
