{
    "data" : [
        {
            "id": 1,
            "blogCategory": "Featured",
            "blogTitle" : "Introduction to 'Daily Dose'",
            "slug": "fitness-mantra-to-live-fit-life",
            "postedOn": "March 14, 2021",
            "author": "Adarsh Verma, Praveen Mishra and Sukant Arora",
            "blogImage": "fitness-blog-post.png",
            "blogText": "This pseudo site works as an experimental, visually appealing object for us students to explore the variety of ways in which we can write blogs. The title attracted us, because of its untapped potential for creativity and appeal in the modern world, where the number of online creators is rising like anything. The blogs posted by us, on the other hand, are either picked up from the net, or are included from our own previous attempts at writing. This first blog is posted by us as an introduction to our project itself, simultaneously accepting any major flaws that you might have noticed in its application. Thank you!"
        },
        {
            "id" : 2,
            "blogCategory": "Comedy",
            "blogTitle": "What it is to be the Batman?",
            "slug": "beautiful-and-special-moment",
            "postedOn": "May 03, 2016",
            "author": "Bruce Wayne",
            "blogImage": "batman.jpg",
            "blogText": "I have been asked multiple times by my dear friends (which are few), about the physical and mental toll of being the caped crusader. I usually don't reply to preserve the integrity of the character I'm playing, but this platform allows me to express openly my personal thoughts over it. I could very well say that it's no vacation, but that wouldn't be true. Surely, I might die in a couple of years after the innumerable times I've been left paralyzed by enemies much more powerful than me (and with a larger ability to fly), and I do have some positive thoughts about the unpopular opinion of my psychosis (some people argue that it's just because of the lack of any real therapy when I needed it the most), but that doesn't steal any of the fun I get from beating people with my bare hands and calling it justice. It's exhilarating, and it helps me cope up with the absence of any powerful emotional indulgence that I might have with people. All my work friends are adamant over the notion that my retirement would do me good, but I'm waiting, because you either die a hero, or live long enough to see yourself become the villain."
        },
        {
            "id": 3,
            "blogCategory": "Simple",
            "blogTitle": "On Anger",
            "slug": "beauti-lies-within-special",
            "postedOn": "Apr 02, 2017",
            "author": "Anonymous",
            "blogImage": "Anger.jpg",
            "blogText": "'There was something peculiarly gratifying about shouting in a blind rage until your words ran out. Of course, the aftermath was less pleasant. Once you'd told everyone you hated them and not to come after you, where exactly did you go?' - Clockwork Angel, Cassandra Clare. Anger has a way of coming back to you. It’s the anchor that holds us all connected to the basest of our emotions, as well as a speedboat—churning and frothing the clear and cool calmness of the water. Writers from history, as well as from the modern era, made characters revolving around these emotions, and anger played a role unlike any other. Who can forget Hamlet’s revenge at Claudius; or Atwood’s Nolite te bastardes carborundorum (Don’t let the bastards grind you down), pertaining to the highly dystopian setting of her novel. But I have to recount my own account of this terrible and somewhat necessary emotion, and so I’ll humble down the contents of this essay to my narration.\nAn honest remark: Half of the things I’ll write here will be too toned up, or will be so minute you’ll ignore them. But you’ll understand the way we’re supposed to write, don’t you? It’s to bring an effect, and I hope you’ll not claw your way through this disguised element of writing to be angry at me (A weak joke to ease in the information). \nIt was during a dark day in my life, as most of them are. But this one was particularly horrid; I don’t really have any reason for it whatsoever. I think most of our days are decided by our filthy mind in the crepuscular dawn, as to how it will want to be the whole time. I won’t want to bore you with the particulars, and come straight to the matter. I was dipped in irritation, I felt like punching through faces, and as I usually do it with walls, it was not a healthy prospective for a face. But we all feel the same way sometimes (We do, don’t we?); the reason this day was so significant was that I knew there was absolutely nothing nasty with me, and yet everything seemed wrong and out of place. It was like a piece of wood surprised at realizing its true place in the fire, when it already knew it was firewood. And so it was more harm done to me than any other, and it was somehow satisfactory. \nI returned home from school, kicking every stone I could find, crushing every dry leaf to hear that pleasant crunch. Reached home, shut the door, and then I did what you’ll judge pure madness—I took out my textbooks, ripped them into perfectly shaped squares (sorry to disappoint, I’m a keeper), took out my bottle, tried to break it in half, and when it won’t do so, filled it with water, and made it fall, head first, onto the solid lime below my feet. It gave in to the mad person above it, and ejected its contents all over the floor. I think the coldness of the lucid water touching my feet brought me to the sad and forlorn reality of things then, and I put the square pieces in my bag, which was surely the next target, picked up the bottle, mopped the floor, fell down on my bed, and watched Batman for a while. \nAnd so ended my little spell of encumbering madness due to anger, and though it was minute in its effect, it was too funny, or even worrisome to ignore, and necessary perhaps, as William Blake wrote: \n'I was angry with my friend:I told my wrath, my wrath did end.\nI was angry with my foe:\nI told it not, my wrath did grow.'"
        },
        {
            "id": 4,
            "blogCategory": "Poetry",
            "blogTitle": "Song Of Myself",
            "slug": "sliding-my-way-to-life",
            "postedOn": "Jan 02, 1855",
            "author": "Walt Whitman",
            "blogImage": "whitman.jpg",
            "blogText": "This is what you shall do; Love the earth and sun and the animals, despise riches, give alms to every one that asks, stand up for the stupid and crazy, devote your income and labor to others, hate tyrants, argue not concerning God, have patience and indulgence toward the people, take off your hat to nothing known or unknown or to any man or number of men, go freely with powerful uneducated persons and with the young and with the mothers of families, read these leaves in the open air every season of every year of your life, re-examine all you have been told at school or church or in any book, dismiss whatever insults your own soul, and your very flesh shall be a great poem and have the richest fluency not only in its words but in the silent lines of its lips and face and between the lashes of your eyes and in every motion and joint of your body."
        },
        {
            "id": 5,
            "blogCategory": "Featured",
            "blogTitle": "Conclusion",
            "slug": "memories-from-last-summer",
            "postedOn": "March 14, 2021",
            "author": "Adarsh Verma, Praveen Mishra and Sukant Arora",
            "blogImage": "conclusion.jpg",
            "blogText": "This is a sample blogpost, much like the previous posts showcasing the myriad of genres a simple weblogging site has to offer. The posts and the content of the site was written by our team, with the sole exception of the licensed poem by Walt Whitman, to help with any possible cases of plagiarism performed on the data of this functional front-end."
        }
    ]
}